# -*- coding: utf-8 -*-

import requests
import re

from mongodb.config import MONGODB_FAMU_SINA
from mongodb.mongdb_1 import CMongodb


def get_sina_data(key_list):
    """
    var hq_str_sh601006="shxxxxxx,5.900,5.900,5.890,5.910,5.880,5.890,5.900,12680536,74743067.000,4500,5.890,1347985,5.880,569200,5.870,446400,5.860,539600,5.850,1533509,5.900,769800,5.910,363510,5.920,192330,5.930,343500,5.940,2021-08-13,15:00:01,00,";
    0：”大秦铁路”，股票名字；
    1：”27.55″，今日开盘价；
    2：”27.25″，昨日收盘价；
    3：”26.91″，当前价格；
    4：”27.55″，今日最高价；
    5：”26.20″，今日最低价；
    6：”26.91″，竞买价，即“买一”报价；
    7：”26.92″，竞卖价，即“卖一”报价；
    8：”22114263″，成交的股票数，由于股票交易以一百股为基本单位，所以在使用时，通常把该值除以一百；
    9：”589824680″，成交金额，单位为“元”，为了一目了然，通常以“万元”为成交金额的单位，所以通常把该值除以一万；
    10: ”4695″，“买一”申请4695股，即47手；
    11：”26.91″，“买一”报价；
    (10, 11), (12, 13), (14, 15), (16, 17), (18, 19) 分别为“买二”至“买四的情况”
    20：”3100″，“卖一”申报3100股，即31手；
    21：”26.92″，“卖一”报价
    (22, 23), (24, 25), (26,27), (28, 29)分别为“卖二”至“卖四的情况”
    30：”2008-01-11″，日期；
    31：”15:05:32″，时间；
    :return:
    """
    url = 'http://hq.sinajs.cn/list={}'.format(','.join(key_list))
    headers = {
        "content-type": "application/x-www-form-urlencoded",
        "Referer": "http://finance.sina.com.cn",
    }
    ret = requests.post(url, headers=headers)
    if not ret.ok:
        print(ret)
        return

    content = ret.content.decode("gbk").encode('utf8')
    content = str(content, encoding='utf-8')
    return content


def read_sina_data(content):

    match_regex_str = r'var hq_str_(?P<key>\w+)\=\"(?P<股票名字>.*)\,' \
                      r'(?P<今日开盘价>\d+(\.\d+)?)\,' \
                      r'(?P<昨日收盘价>\d+(\.\d+)?)\,'\
                      r'(?P<当前价格>\d+(\.\d+)?),' \
                      r'(?P<今日最高价>\d+(\.\d+)?),' \
                      r'(?P<今日最低价>\d+(\.\d+)?),' \
                      r'(?P<竞买一报价>\d+(\.\d+)?),' \
                      r'(?P<竞卖一报价>\d+(\.\d+)?),' \
                      r'(?P<成交的股票数>\d+(\.\d+)?),' \
                      r'(?P<成交金额>\d+(\.\d+)?),' \
                      r'(?P<买一股数>\d+(\.\d+)?),' \
                      r'(?P<买一报价>\d+(\.\d+)?),' \
                      r'(?P<买二股数>\d+(\.\d+)?),' \
                      r'(?P<买二报价>\d+(\.\d+)?),' \
                      r'(?P<买三股数>\d+(\.\d+)?),' \
                      r'(?P<买三报价>\d+(\.\d+)?),' \
                      r'(?P<买四股数>\d+(\.\d+)?),' \
                      r'(?P<买四报价>\d+(\.\d+)?),' \
                      r'(?P<买五股数>\d+(\.\d+)?),' \
                      r'(?P<买五报价>\d+(\.\d+)?),' \
                      r'(?P<卖一股数>\d+(\.\d+)?),' \
                      r'(?P<卖一报价>\d+(\.\d+)?),' \
                      r'(?P<卖二股数>\d+(\.\d+)?),' \
                      r'(?P<卖二报价>\d+(\.\d+)?),' \
                      r'(?P<卖三股数>\d+(\.\d+)?),' \
                      r'(?P<卖三报价>\d+(\.\d+)?),' \
                      r'(?P<卖四股数>\d+(\.\d+)?),' \
                      r'(?P<卖四报价>\d+(\.\d+)?),' \
                      r'(?P<卖五股数>\d+(\.\d+)?),' \
                      r'(?P<卖五报价>\d+(\.\d+)?),' \
                      r'(?P<日期>\d{4}-\d{2}-\d{2}),' \
                      r'(?P<时间>\d{2}:\d{2}:\d{2}),' \
                      r'(?P<k32>\d+),\";'
    ret_list = []
    for r in re.finditer(match_regex_str, content):
        ret_list.append(r.groupdict())
    return ret_list


def save_sina_data(data_list):
    mongo_obj = CMongodb(MONGODB_FAMU_SINA)
    mongo_obj.insert_many(data_list)


def calc_xxx(i, j):
    """

    :param i: 股票当前价格
    :param j: 总价值
    :return 返回由于交易费用，影响的股票的价格变动，如果要有收益，股票至少有多少变动才可以
    """
    cnt = j/i
    total = j * 1/ 1000+ max(j *4 / 10000, 10) + j * 2/100000
    print("{}, {} * 2, {} = {}".format(j * 1/ 1000, max(j *4 / 10000, 10), j * 2/100000, total))
    print("{}".format(total*1.0/cnt))


if __name__ == "__main__":

    # calc_xxx(11.35, 34020)
    key_list = ['sh601006', 'sh601975']
    rr = get_sina_data(key_list)

    # rr = 'var hq_str_sh601006="大秦铁路,6.200,6.200,6.170,6.200,6.170,6.170,6.180,4956200,30633344.000,968200,6.170,1117400,6.160,669200,6.150,286300,6.140,464800,6.130,315800,6.180,138700,6.190,216000,6.200,324600,6.210,796100,6.220,2021-11-19,10:42:36,00,";' \
    #      'var hq_str_sh601975="招商南油,1.940,1.940,1.950,1.950,1.940,1.940,1.950,4286401,8331312.000,3002399,1.940,5566400,1.930,2482500,1.920,1206400,1.910,1207500,1.900,4692679,1.950,6418166,1.960,2635240,1.970,1299873,1.980,772400,1.990,2021-11-19,10:42:27,00,";'


    print(rr)
    if not rr:
        pass
    else:
        data_list = read_sina_data(rr)
        print(data_list)
        save_sina_data(data_list)

